Repository: FarukPie/FitableV2
Catalog: mobile_app/lib/l10n/app_*.arb
Languages: tr

source: Welcome
tr: Hoşgeldiniz

source: Welcome Back
tr: Tekrar Hoşgeldiniz

# emailLabel
source: Email
tr: E-posta

# emailError
source: Please enter email
tr: Lütfen e-posta giriniz

# passwordLabel
source: Password
tr: Şifre

# passwordError
source: Please enter password
tr: Lütfen şifre giriniz

# loginButton
source: Login
tr: Giriş Yap

# registerLink
source: Don't have an account? Register
tr: Hesabınız yok mu? Kaydolun

# myClosetTooltip
source: My Closet
tr: Dolabım

# analyzingTitle
source: Analyzing Product Details...
tr: Ürün Detayları Analiz Ediliyor...

# analyzingSubtitle
source: Our AI is finding your perfect fit.
tr: Yapay zekamız en uygun bedeni buluyor.

# homeTitle
source: Find Your Perfect Size
tr: Mükemmel Bedeninizi Bulun

# homeSubtitle
source: Paste a product link below to get an instant size recommendation based on your body profile.
tr: Vücut profilinize göre anında beden önerisi almak için ürün linkini aşağıya yapıştırın.

# urlHint
source: Paste product URL here...
tr: Ürün URL'sini buraya yapıştırın...

# analyzeButton
source: Analyze Now
tr: Analiz Et

# myMeasurementsTitle
source: My Measurements
tr: Ölçülerim

# measureWelcome
source: Welcome! Please enter your measurements to get started.
tr: Hoşgeldiniz! Başlamak için lütfen ölçülerinizi girin.

source: Personal Details
tr: Kişisel Bilgiler

source: Body Measurements
tr: Vücut Ölçüleri

# bodyShapeTitle
source: Body Shape
tr: Vücut Tipi

# genderMale
source: Male
tr: Erkek

# genderFemale
source: Female
tr: Kadın

# genderOther
source: Other
tr: Diğer

# heightLabel
source: Height (cm)
tr: Boy (cm)

# weightLabel
source: Weight (kg)
tr: Kilo (kg)

# chestLabel
source: Chest Circumference (cm)
tr: Göğüs Çevresi (cm)

# waistLabel
source: Waist Circumference (cm)
tr: Bel Çevresi (cm)

# hipsLabel
source: Hips (cm)
tr: Basen (cm)

# shoulderLabel
source: Shoulder Circumference (cm)
tr: Omuz Çevresi (cm)

# legLengthLabel
source: Leg Length (cm)
tr: Bacak Uzunluğu (cm)

# footLengthLabel
source: Foot Length (cm)
tr: Ayak Uzunluğu (cm)

source: Complete Setup
tr: Kurulumu Tamamla

source: Update Profile
tr: Profili Güncelle

source: Measurements Saved!
tr: Ölçüler Kaydedildi!

# myClosetTitle
source: My Closet
tr: Dolabım

# closetEmpty
source: Your closet is empty.
tr: Dolabınız boş.

# sizeLabel
source: Size
tr: Beden

# scoreLabel
source: Score
tr: Skor

# removeItemTitle
source: Remove Item
tr: Ürünü Kaldır

# removeItemConfirm
source: Are you sure you want to remove this item from your closet?
tr: Bu ürünü dolabınızdan kaldırmak istediğinize emin misiniz?

# cancelButton
source: Cancel
tr: İptal

# removeButton
source: Remove
tr: Kaldır

source: Item removed.
tr: Ürün kaldırıldı.

# removeFailed
source: Failed to remove:
tr: Kaldırılamadı:

# requiredError
source: This field is required
tr: Bu alan gerekli

# recommendationTitle
source: Recommendation
tr: Beden Önerisi

# recommendedSizeLabel
source: Recommended Size
tr: Önerilen Beden

# confidenceLabel
source: Confidence
tr: Güven Oranı

# discardButton
source: Discard
tr: Çöpe At

# addToClosetButton
source: Add to Closet
tr: Dolabıma Koy

# addedToClosetMessage
source: Added to Closet!
tr: Dolaba Eklendi!

# errorMessage
source: Error
tr: Hata

# howToMeasureTitle
source: How to Measure
tr: Nasıl Ölçülür?

# shoulderMeasureGuide
source: Measure from the tip of one shoulder bone to the other across your back.
tr: Sırtınızdan, bir omuz kemiğinin ucundan diğerine ölçün.

# waistMeasureGuide
source: Measure around your natural waistline, just above your hips.
tr: Doğal bel çevrenizi, kalçanızın hemen üzerinden ölçün.

# legLengthMeasureGuide
source: Measure from the top of your inner thigh down to your ankle.
tr: İç bacağınızın en üst kısmından ayak bileğinize kadar ölçün.

# footLengthMeasureGuide
source: Measure from your heel to the tip of your longest toe.
tr: Topuğunuzdan en uzun parmağınızın ucuna kadar ölçün.

# chestMeasureGuide
source: Measure around the fullest part of your chest, keeping the tape horizontal.
tr: Mezurayı, göğsünüzün en geniş (tepe) noktasından ve sırtınızdan geçecek şekilde ölçün.

# handSpanMeasureGuide
source: Spread your hand fully. Measure the distance by counting how many spans (thumb to pinky tip) fit the area.
tr: Elinizi tamamen açın. Başparmak ve serçe parmak ucunuz arasındaki mesafeyi (karış) sayarak ölçüm yapın.

# chestMeasureGuideMale
source: Measure around the fullest part of your chest, under your armpits.
tr: Mezurayı koltuk altlarınızın altından, göğsünüzün en geniş yerinden geçirerek ölçün.

# chestMeasureGuideFemale
source: Measure around the fullest part of your bust.
tr: Mezurayı göğsünüzün en dolgun yerinden (meme ucu hizası) geçirerek ölçün.

# handSpanMode
source: No Tape? (Use Hand Span)
tr: Mezuram Yok (Karış Hesabı)

# handSpanInfo
source: Based on height, 1 span â‰ˆ {value} cm
tr: Boyunuza göre 1 karış ≈ {value} cm

# spansSuffix
source: spans
tr: karış

# enterHeightFirst
source: Enter height to enable hand span mode
tr: Karış hesabını açmak için önce boyunuzu girin

# helloTitle
source: Hello!
tr: Merhaba!

# signInSubtitle
source: Sign in to your account
tr: Hesabınıza giriş yapın

# emailHint
source: E-mail
tr: E-posta

# emailRequired
source: Please enter email
tr: Lütfen e-posta giriniz

# passwordHint
source: Password
tr: Şifre

# passwordRequired
source: Please enter password
tr: Lütfen şifre giriniz

source: Remember me
tr: Beni Hatırla

# signInButton
source: SIGN IN
tr: GİRİŞ YAP

# createAccountButton
source: CREATE ACCOUNT
tr: HESAP OLUŞTUR

# welcomeBackTitle
source: Welcome Back!
tr: Tekrar Hoşgeldiniz!

# welcomeBackSubtitle
source: Log in to find your perfect fit.
tr: Mükemmel bedeninizi bulmak için giriş yapın.

# createAccountTitle
source: Create Account
tr: Hesap Oluştur

# joinUsSubtitle
source: Join us to find your perfect fit
tr: Mükemmel bedeninizi bulmak için bize katılın

# fullNameHint
source: Name Surname
tr: Ad Soyad

# ageHint
source: Age
tr: Yaş

# genderLabel
source: Gender
tr: Cinsiyet

# usernameHint
source: Username
tr: Kullanıcı Adı

# confirmPasswordHint
source: Confirm Password
tr: Şifreyi Onayla

# passwordMismatch
source: Mismatch
tr: Eşleşmiyor

# passwordMinChars
source: Min 6 chars
tr: En az 6 karakter

# registrationSuccess
source: Registration successful! Please login.
tr: Kayıt başarılı! Lütfen giriş yapın.

# alreadyHaveAccount
source: Already have an account?
tr: Zaten hesabınız var mı?

# logInLink
source: Log In
tr: Giriş Yap

# joinFitableTitle
source: Join Fitable!
tr: Fitable'a Katıl!

# joinFitableSubtitle
source: Start your journey to better fit today.
tr: Daha iyi bir uyum için yolculuğuna bugün başla.

source: Login Failed:
tr: Giriş Başarısız:

source: Registration Failed:
tr: Kayıt Başarısız:

source: Auto Calculated
tr: Otomatik Hesaplandı

# shapeInvertedTriangle
source: Inverted Triangle
tr: Ters Üçgen

# shapeTriangle
source: Triangle
tr: Üçgen

# shapeRectangular
source: Rectangular
tr: Dikdörtgen

# invalidCredentials
source: Invalid username or password.
tr: Kullanıcı adı veya şifre hatalı.

# errorHistoryLoad
source: Failed to load history.
tr: Geçmiş yüklenemedi.

# errorMeasurementsLoad
source: Failed to load measurements.
tr: Ölçüler yüklenemedi.

# errorAccountDelete
source: Failed to delete account.
tr: Hesap silinemedi.

# errorLoginGeneric
source: Login failed.
tr: Giriş başarısız.

# errorRegisterGeneric
source: Registration failed.
tr: Kayıt başarısız.

# errorUpdateMeasurements
source: Failed to update measurements.
tr: Ölçüler güncellenemedi.

# errorAddToCloset
source: Failed to add to closet.
tr: Dolaba eklenemedi.

# errorRemoveFromCloset
source: Failed to remove item.
tr: Ürün kaldırılamadı.

# errorNetwork
source: Network error. Please try again.
tr: Ağ hatası. Lütfen tekrar deneyin.

# errorUnknown
source: An unknown error occurred.
tr: Bilinmeyen bir hata oluştu.
